testCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          15000;
        startFace       29690;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          15000;
        startFace       44690;
    }
    right
    {
        type            patch;
        nFaces          250;
        startFace       59690;
    }
    bottom
    {
        type            patch;
        nFaces          60;
        startFace       59940;
    }
    top
    {
        type            patch;
        nFaces          60;
        startFace       60000;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          250;
        startFace       60060;
    }
)

// ************************************************************************* //
