testCase/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          9600;
        startFace       18980;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          9600;
        startFace       28580;
    }
    right
    {
        type            patch;
        nFaces          160;
        startFace       38180;
    }
    bottom
    {
        type            patch;
        nFaces          60;
        startFace       38340;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          160;
        startFace       38400;
    }
    solid_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          60;
        startFace       38560;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_solid;
    }
)

// ************************************************************************* //
