testCase/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         pointCellsLeastSquares;
}

divSchemes
{
    default         none;

    div(phi,alpha)  Gauss vanLeer;
    div(phirb,alpha) Gauss linear;


    div(phi,U)      Gauss limitedLinearV 1;
    div(rhoPhi,U)      Gauss limitedLinearV 1;
    div(phi,K)      Gauss linear;
    div(phi,h)      Gauss limitedLinear 1;
    div(phi,k)      Gauss limitedLinear 1;
    div(phi,epsilon) Gauss limitedLinear 1;
    div(phi,R)      Gauss limitedLinear 1;
    div(R)          Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phiv,p)     Gauss linear;
    div(phi,e)      Gauss limitedLinear 1;
    div(rhoCpLPhi,T.liquid) Gauss linear;
    div(rhoCpVPhi,T.vapor) Gauss linear;
}

laplacianSchemes
{
    default        Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
    nRequired       yes;
}

fluxRequired
{
    default         no;
    p_rgh           yes;
}


// ************************************************************************* //
