testCase/system/runParams
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Define mesh variables (all lengths in mm for easier manipulation)

Lx      1.5e-3;     // X length in m

fluidLy  2.25e-3;    // Fluid Y length in m

solidLy  4e-3;     // Solid Y length in m

dx     0.025e-3;   // Grid size in m (25 micrometers)

theta   5.0;     // Angle in degrees (5 degrees)

pi 	3.14159265359;

// Derived quantities

Ly  #calc "$fluidLy + $solidLy";  // Total Y length in mm

nX     #calc "$Lx / $dx";          // Number of cells in x-direction

nY     #calc "$Ly / $dx";    // Number of cells in y-direction

Lz     #calc "$Lx*$theta/2*$pi/180";

// Heat Flux

q	34e3; // Heat flux from heater in Watts

// Activation Temperature

Tact	379.17;

// Bulk Temperature

Tbulk	373.15;

